Use material features in docs (#517)
Signed-off-by: Luke Hinds <lukehinds@gmail.com>
